<font color='green'>

### 9. İleri Seviye Birleştirme İşlemleri

### Önceki nottaki birleştirmeler alt alta birleştirme veya yan yana birleştirme şeklindeydi.

## 1) Bire Bir Birleştirme : Tüm elemanların iki veri setinde de  aynen yer alması durumudur.

### Sözlük üzerinden iki tane dataframe oluşturalım :

In [1]:
import pandas as pd

In [9]:
dataf1=pd.DataFrame({'calisanlar' : ['Semih','Melih','Samet','Ayperi'],
            'grup' : ['Muhasebe','Muhendislik','Muhendislik','IK']})
dataf1

  calisanlar         grup
0      Semih     Muhasebe
1      Melih  Muhendislik
2      Samet  Muhendislik
3     Ayperi           IK

In [10]:
dataf2=pd.DataFrame({'calisanlar' : ['Semih','Melih','Samet','Ayperi'],
			'ilk_giris': [2010,2009,2014,2019]})
dataf2

  calisanlar  ilk_giris
0      Semih       2010
1      Melih       2009
2      Samet       2014
3     Ayperi       2019

In [11]:
pd.merge(dataf1,dataf2)

  calisanlar         grup  ilk_giris
0      Semih     Muhasebe       2010
1      Melih  Muhendislik       2009
2      Samet  Muhendislik       2014
3     Ayperi           IK       2019

### İki veri setinde de çalışanlar olduğu için çalışanlar üzerinden birleştirdi. Default olarak yapmıştı ancak iki veri setinde de birden fazla ortak değişken olduğu zaman kendimiz neyin üzerinde birleştirmesini isterse onu belirtebiliriz. Burada buna ihtiyacımız yok ancak ilerisi için göstermiş olalım :

In [14]:
pd.merge(dataf1,dataf2, on="calisanlar")

  calisanlar         grup  ilk_giris
0      Semih     Muhasebe       2010
1      Melih  Muhendislik       2009
2      Samet  Muhendislik       2014
3     Ayperi           IK       2019

## 2) Çoktan Teke Birleştirme :

In [16]:
dataf3=pd.merge(dataf1,dataf2)
dataf3

  calisanlar         grup  ilk_giris
0      Semih     Muhasebe       2010
1      Melih  Muhendislik       2009
2      Samet  Muhendislik       2014
3     Ayperi           IK       2019

### 1. veri setimiz bu olsun.

In [18]:
dataf4=pd.DataFrame({'grup':['Muhasebe','Muhendislik','İK'],
			'mudur' : ['Engin','Mustafa','Selin']})
dataf4

          grup    mudur
0     Muhasebe    Engin
1  Muhendislik  Mustafa
2           İK    Selin

### 2. veri setimiz de bu olsun.

### İlk veri setimizde 3 tane değişken varken ikinci veri setimizde 2 tane değişken var.
### İlk veri setimizde 4 tane değer varken ikinci veri setimizde 3 tane değer var.
### Bu ikisini bir araya getirdiğimizde iki veriyi birleştirecektir..

In [19]:
pd.merge(dataf3,dataf4)

  calisanlar         grup  ilk_giris    mudur
0      Semih     Muhasebe       2010    Engin
1      Melih  Muhendislik       2009  Mustafa
2      Samet  Muhendislik       2014  Mustafa

## 3) Çoktan Çoka Birleştirme (mini to mini):

In [22]:
dataf5=pd.DataFrame ({'grup' : ['Muhasebe','Muhasabe','Muhendislik','Muhendislik','IK','IK'],
			'yetenekler' : ['matematik','excel','kodlama','linux','excel','yonetim']})
dataf5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasabe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

### dataf1 ' i hatırlayalım.

In [23]:
dataf1

  calisanlar         grup
0      Semih     Muhasebe
1      Melih  Muhendislik
2      Samet  Muhendislik
3     Ayperi           IK

In [24]:
pd.merge(dataf1,dataf5)

  calisanlar         grup yetenekler
0      Semih     Muhasebe  matematik
1      Melih  Muhendislik    kodlama
2      Melih  Muhendislik      linux
3      Samet  Muhendislik    kodlama
4      Samet  Muhendislik      linux
5     Ayperi           IK      excel
6     Ayperi           IK    yonetim

### Bütün çalışanlar çokladı ve her birisine karşılık gelen grupla birlikte yetenekleri de eklendi. Çoklama bir problem değildir.(Bu veri setinden analitik bir işlem yapacağımız zaman tabi ki problem yaratacaktır.)

### [10. Toplulaştırma ve Gruplaştırma 'Aggregation & Grouping' notlarına geçmek için tıklayınız.](https://github.com/semihstp/Veri-Bilimi-Not-Defterim/blob/master/Pandas%20K%C3%BCt%C3%BCphanesi/10.%20Toplula%C5%9Ft%C4%B1rma%20ve%20Grupla%C5%9Ft%C4%B1rma%20'Aggregation%20%26%20Grouping'.ipynb)